TRUNCATE TABLE public."Activities", public."Buildings", public."Organizations", public."Organizations_Activities" RESTART IDENTITY CASCADE;

INSERT INTO public."Activities" (name, parent_id) VALUES
('Еда', NULL),
('Автомобили', NULL),
('Мясная продукция', 1),
('Молочная продукция', 1),
('Грузовые', 2),
('Легковые', 2),
('Запчасти', 6),
('Аксессуары', 6),
('Фары', 5),
('Сосиски', 3),
('Колбасы', 3);


INSERT INTO public."Buildings" (address, latitude, longitude) VALUES
('г. Москва, ул. Тверская, д. 10, офис 15', 55.7602, 37.6185),
('г. Санкт-Петербург, Невский проспект, д. 28, офис 7', 59.9343, 30.3351),
('г. Екатеринбург, ул. Малышева, д. 50, офис 12', 55.7961, 49.1064),
('г. Новосибирск, Красный проспект, д. 20, офис 3', 55.0302, 82.9204),
('г. Красноярск, ул. Ленина, д. 15, офис 9', 56.0106, 92.8526),
('г. Воронеж, ул. Плехановская, д. 10, офис 5', 51.6608, 39.2003),
('г. Калининград, Ленинский проспект, д. 30, офис 8', 54.7104, 20.5109),
('г. Казань, ул. Баумана, д. 5, офис 11', 55.7961, 49.1064),
('г. Челябинск, ул. Кирова, д. 100, офис 4', 55.1599, 61.4026),
('г. Иркутск, ул. Карла Маркса, д. 14, офис 6', 52.2864, 104.2807);


INSERT INTO public."Organizations" ("name", phone, building_fk) VALUES
('Центр "Белый лев"', '+7 (495) 111-22-33', 1),
('Агентство "Серебряный волк"', '+7 (812) 222-33-44', 1),
('Бюро "Быстрый ястреб"', '+7 (343) 333-44-55', 1),
('Компания "Мудрый филин"', '+7 (383) 444-55-66', 2),
('Центр "Синий кит"', '+7 (391) 555-66-77', 2),
('Агентство "Золотой орел"', '+7 (3812) 666-77-88', 3),
('Бюро "Ловкий лис"', '+7 (4852) 777-88-99', 4),
('Компания "Сильный медведь"', '+7 (846) 888-99-00', 4),
('Центр "Стремительный сокол"', '+7 (863) 999-00-11', 5),
('Агентство "Грациозный олень"', '+7 (4722) 000-11-22', 6),
('Бюро "Хитрый енот"', '+7 (4012) 111-22-33', 7),
('Компания "Верный пес"', '+7 (4842) 222-33-44', 8),
('Центр "Свободный конь"', '+7 (3522) 333-44-55', 9),
('Агентство "Гордый тигр"', '+7 (4932) 444-55-66', 10),
('Бюро "Трудолюбивый бобер"', '+7 (3412) 555-66-77', 1);


INSERT INTO public."Organizations_Activities" (organization_fk, activity_fk) VALUES
(1,1), (1,3), (1,10),(1,11),(2,2),(2,6),
(2,8), (3,2), (3,5), (3,7), (4,1),(4,4),
(5,2), (5,8), (5,9), (6,2), (6,5),(6,6),
(6,7), (7,1), (7,3), (7,11),(8,2),(8,5),
(8,9), (9,2), (9,6), (9,8), (10,1),(10,4),
(10,10),(11,2),(11,7),(11,9),(12,1),(12,3),
(12,11),(13,2),(13,5),(13,6),(14,2),(14,7),
(14,8),(15,1),(15,4),(15,11);




